app/Models/Cronmodel.php

       public function getdetails() {

        $db = \Config\Database::connect();
        $builder = $db->table('cronDetails');

        $builder->select('*');
        $query = $builder->get();
---
SELECT *
FROM `cronDetails`

    public function insertCron($data) {

        $db = \Config\Database::connect();

        $tbl = $db->table('cronDetails');


        $tbl->insert($data);
---
INSERT INTO `cronDetails` (`cron_label`, `cron_url`, `minute`, `day_of_the_week`, `days`, `month`, `reccurance`, `hour`, `cron_command`) VALUES ('segsdf', '', '*/4', '*', '*', '*', '∞', '*', '*/4 * * * * /usr/bin/php /var/www/html/cronjob/app/Scripts/CronURLScript.php >> /home/breinard/Downloads/log.log 2>&1 ')

     public function deleteCron($data) {

        $db = \Config\Database::connect();

        $cron_id = $data['cron_id'];

        $tbl = $db->table('cronDetails');
        $tbl->where('cron_id', $cron_id);
        $tbl->delete();
---
DELETE FROM `cronDetails`
WHERE `cron_id` = '47'

    public function getDeleteCronDetail($data) {

         $db = \Config\Database::connect();
        $builder = $db->table('cronDetails');

        $builder->select('cron_command');
        $builder->where('cron_id',$data);
        $query = $builder->get();
---
SELECT `cron_command`
FROM `cronDetails`
WHERE `cron_id` = '47'